import random
from datetime import date

num = random.randint(1000, 99999999)

data = [
    {
        "СтатусЗакрытия": False,
        "ПредставлениеЗаданияНаСмену": f"Создание задания {num}",
        "Линия": f"Линия {num}",
        "Смена": f"Смена {num}",
        "Бригада": f"Бригада {num}",
        "НомерПартии": num,
        "ДатаПартии": f"{date.today()}",
        "Номенклатура": f"№ {num}",
        "КодЕКН": "654651",
        "ИдентификаторРЦ": "6553661",
        "ДатаВремяНачалаСмены": "2024-02-15T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-02-15T08:00:00+05:00",
    },
    {
        "СтатусЗакрытия": False,
        "ПредставлениеЗаданияНаСмену": f"Создание задания  {num + 100}",
        "Линия": f"Линия {num + 100}",
        "Смена": f"Смена {num + 100}",
        "Бригада": f"Бригада {num + 100}",
        "НомерПартии": num + 100,
        "ДатаПартии": f"{date.today()}",
        "Номенклатура": f"№ {num + 100}",
        "КодЕКН": "654651",
        "ИдентификаторРЦ": "6553661",
        "ДатаВремяНачалаСмены": "2024-02-15T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-02-15T08:00:00+05:00",
    },
    {
        "СтатусЗакрытия": True,
        "ПредставлениеЗаданияНаСмену": f"Сvvssоздание задания {num}",
        "Линия": f"Линия {num}",
        "Смена": f"Смена {num}",
        "Бригада": f"Бригада {num}",
        "НомерПартии": num + 6,
        "ДатаПартии": f"{date.today()}",
        "Номенклатура": f"№ {num}",
        "КодЕКН": "654651",
        "ИдентификаторРЦ": "6553661",
        "ДатаВремяНачалаСмены": "2024-02-15T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-02-15T08:00:00+05:00",
    },
    {
        "СтатусЗакрытия": True,
        "ПредставлениеЗаданияНаСмену": f"Сvvssоздание задания {num}",
        "Линия": f"Линия {num}",
        "Смена": f"Смена {num}",
        "Бригада": f"Бригада {num}",
        "НомерПартии": num + 10,
        "ДатаПартии": f"{date.today()}",
        "Номенклатура": f"№ {num}",
        "КодЕКН": "654651",
        "ИдентификаторРЦ": "6553661",
        "ДатаВремяНачалаСмены": "2024-02-15T20:00:00+05:00",
        "ДатаВремяОкончанияСмены": "2024-02-15T08:00:00+05:00",
    },
]

update = {
    "status_closed": True,
    "shift_task_representation": f"Update задания на тестовую смену {num}",
    "line": f"Линия {num}",
    "shift": f"Смена {num}",
    "brigade": f"Бригада {num}",
    "nomenclature": f"№ {num}",
    "code_ekn": "654651",
    "identifier_rc": "6553661",
}
